Repository: R4356th/smerge
Catalog: snapmerge/static/locale/*/LC_MESSAGES/django.po
Languages: de

source: Enter a valid URL.
de: Bitte gültige URL eingeben.

source: Enter a valid integer.
de: Bitte gültige Zahl eingeben.

source: Enter a valid email address.
de: Bitte gültige E-Mail-Adresse eingeben.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
de: Bitte nur Buchstaben, Zahlen oder Unterstriche verwenden.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
de: Bitte nur Buchstaben, Zahlen oder Unterstriche verwenden.

source: Enter a valid IPv4 address.
de: Bitte gültige IPv4 Addresse eingeben.

source: Enter a valid IPv6 address.
de: Bitte gültige IPv6 Addresse eingeben.

source: Enter a valid IPv4 or IPv6 address.
de: Bitte gültige IPv4 oder IPv6 Addresse eingeben.

source: Enter only digits separated by commas.
de: Nur kommagetrennte Zahlen verwenden.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
de: Stellen Sie sicher, dass der Wert %(limit_value) entspricht (aktuell: %(show_value))

source: Ensure this value is less than or equal to %(limit_value)s.
de: Stellen Sie sicher, dass der Wert kleiner oder gleich %(limit_value) ist.

source: Ensure this value is greater than or equal to %(limit_value)s.
de: Stellen Sie sicher, dass der Wert größer oder gleich %(limit_value) ist.

source: Enter a number.
de: Bitte Zahl eingeben.

source: and
de: und

source: %(model_name)s with this %(field_labels)s already exists.
de: %(model_name)s mit %(field_labels) existiert bereits.

source: Value %(value)r is not a valid choice.
de: %(value)r stellt keinen gültigen Wert dar.

source: This field cannot be null.
de: Dieses Feld darf nicht null sein.

source: This field cannot be blank.
de: Dieses Feld darf nicht leer sein.

source: %(model_name)s with this %(field_label)s already exists.
de: %(model_name)s mit %(field_label) existiert bereits.

source: String (up to %(max_length)s)
de: String (bis zu %(max_length))

source: Comma-separated integers
de: Kommagetrennte Zahlen

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
de: “%(value)s” hat das korrekte Format (YYYY-MM-DD) ist aber ungültig

source: Date (without time)
de: Datum (ohne Uhrzeit)

source: Date (with time)
de: Datum (mit Uhrzeit)

source: “%(value)s” value must be a decimal number.
de: “%(value)” muss gültige Dezimalzahl sein.

source: Decimal number
de: Dezimalzahl

source: Email address
de: Emailadresse

source: “%(value)s” value must be a float.
de: “%(value)s” Wert muss float sein.

source: Floating point number
de: Gleitkommazahl

source: “%(value)s” value must be an integer.
de: “%(value)s” Wert muss Ganzzahl sein.

source: Integer
de: Ganzzahl

source: IPv4 address
de: IPv4 Adresse

source: IP address
de: IP Adresse

source: “%(value)s” value must be either None, True or False.
de: “%(value)s” muss None, True oder False sein.

source: Positive integer
de: Positive Ganzzahl

source: Positive small integer
de: Positive kleine Ganzzahl

source: Small integer
de: Kleine Ganzzahl

source: File
de: Datei

source: Image
de: Bild

source: Enter a valid time.
de: Bitt geben Sie eine gültige Zeit ein.

source: Enter a valid date/time.
de: Bitte geben Sie ein gültiges Datum ein.

source: Enter a valid duration.
de: Bitte geben Sie eine gültige DAuer ein.

source: No file was submitted. Check the encoding type on the form.
de: Keine Datei hochgeladen. Prüfen Sie den encoding type der form

source: No file was submitted.
de: Keine Datei hinzugefügt.

source: The submitted file is empty.
de: Die hochgeladene Datei ist leer.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
de: Bitte gültiges Bild hochladen.

source: Enter a valid UUID.
de: Bitte gültige UUID eingeben.

source: (Hidden field %(name)s) %(error)s
de: (Verstecktes Feld %(name)s) %(error)s

source: Clear
de: Löschen

source: Currently
de: Aktuell

source: Change
de: Ändern

source: Unknown
de: Unbekannt

source: Yes
de: Ja

source: No
de: Nein

source: yes,no,maybe
de: Ja, nein, vielleicht

source: midnight
de: Mitternacht

source: noon
de: Mittag

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

source: Saturday
de: Samstag

source: Sunday
de: Sonntag

source: Mon
de: Mo

source: Tue
de: Di

source: Wed
de: Mi

source: Thu
de: Do

source: Fri
de: Fr

source: Sat
de: Sa

source: Sun
de: So

source: January
de: Januar

source: February
de: Februar

source: March
de: März

source: May
de: Mai

source: June
de: Juni

source: July
de: Juli

source: October
de: Oktober

source: December
de: Dezember

source: mar
de: Mär

source: may
de: Mai

source: oct
de: Okt

source: dec
de: Dez

# abbrev. month
source: March
de: März

# abbrev. month
source: May
de: Mai

# abbrev. month
source: June
de: Juni

# abbrev. month
source: July
de: Juli

# abbrev. month
source: Sept.
de: Sep.

# abbrev. month
source: Oct.
de: Okt.

# abbrev. month
source: Dec.
de: Dez.

# alt. month
source: January
de: Januar

# alt. month
source: February
de: Februar

# alt. month
source: March
de: März

# alt. month
source: May
de: Mai

# alt. month
source: June
de: Juni

# alt. month
source: July
de: Juli

# alt. month
source: October
de: Oktober

# alt. month
source: December
de: Dezember

source: This is not a valid IPv6 address.
de: Keine gültige IPv6 Adresse

source: or
de: oder

source: %d year
de: %d Jahr

source: %d month
de: %d Monat

source: %d week
de: %d Woche

source: %d day
de: %d Tag

source: %d hour
de: %d Stunde

source: 0 minutes
de: 0 Minuten

source: Forbidden
de: Verboten

source: CSRF verification failed. Request aborted.
de: CSRF verification failed. Anfrage abgebrochen.

source: More information is available with DEBUG=True.
de: Mehr Informationen erhalten Sie mit DEBUG=True

source: No year specified
de: Kein Jahr angegeben

source: Date out of range
de: Datum außerhalb Zeitrahmens

source: No month specified
de: Kein Monat angegeben

source: No day specified
de: Kein Tag angegeben

source: No week specified
de: Keine Woche angegeben

source: Password (optional)
de: Passwort (optional)

source: Picture
de: Bild

source: Description
de: Beschreibung

source: Password
de: Passwort

source: Project
de: Projekt

source: Projects
de: Projekte

source: Timestamp
de: Zeitstempel

source: number_scripts
de: Anzahl Skripte

source: number_sprites
de: Anzahl Sprites

source: color
de: Farbe

source: user
de: Benutzer

source: SnapFile
de: Snap-Datei

source: SnapFiles
de: Snap-Dateien

source: Description (optional)
de: Beschreibung (optional)

source: email (optional), for restoring password and pin
de: Email zur Wiederherstellung von Zugangsdaten (optional)

source: File (optional)
de: Datei (optional)

source: No valid xml.
de: Ungültiges XML

source: Invalid Data.
de: Ungültige Daten

source: No such project or wrong password
de: Es existiert kein Projekt mit dieser PIN oder falsches Passwort

source: Your smerge.org projects
de: Deine smerge.org Projekte

source: Something went wrong, please try again or contact us
de: Etwas ist schief gelaufen, versuche es erneut oder kontaktiere uns

source: Mail sent
de: Mail gesendet

source: no valid xml
de: Ungültiges XML

source: Password changed
de: Passwort geändert

source: Wrong password
de: Falsches Passwort

source: something went wrong
de: Etwas ist schief gelaufen

source: Project Name changed
de: Projektname geändert

source: Description changed
de: Beschreibung geändert

source: Project deleted
de: Projekt gelöschht

source: Back
de: Zurück

source: Contact
de: Kontakt

source: Create a new Project
de: Erstelle ein neues Projekt

source: Optional invividual starting Snap! File
de: Optional: Eigene Snap-Datei als Projektstart hochladen

source: If you don't upload a file, a standard blank snap project will be your starting point.
de: Wenn du keine Datei hochlädst, wird ein leeres Snap-Projekt als Ausgangspunkt verwendet.

source: Want to continue working on your project in Smerge?
de: Du möchtest an deinem Projekt in Smerge weiterarbeiten?

source: Or want to provide your students with a template?
de: Oder du möchtest deiner Klasse eine Vorlage zur Verfügung stellen?

source: Upload your starting file here.
de: Lade deine Vorlage hier hoch!

source: You get this file through File - Export project in Snap!).
de: Du kannst die Vorlage über Datei - Projekt exportieren in Snap beziehen.

source: You can add further initial nodes via drag and drop afterwards.
de: Weitere Startpunkte kannst du später via Drag-and-drop hinzufügen

source: No badger has ever dug here!
de: Hier war noch kein Dachs.

source: Your page could not be found. This can have several reasons:
de: Deine Seite konnte nicht gefunden werden. Das kann mehrere Ursachen haben:

source: Your page doesn't exist or
de: Die von dir angeforderte Seite existiert nicht,

source: your page has moved or
de: deine Seite ist umgezogen

source: your page was deleted
de: oder deine Seite wurde gelöscht.

source: Maybe these links will help you:
de: Vielleicht helfen Dir diese Links:

source: Open existing
de: Projekt öffnen

source: Create new
de: Projekt erstellen

source: Some badger tunnels have collapsed
de: Einige Dachstunnel sind eingestürzt.

source: It is not yet clear how long this will last. Maybe other sites are still accessible:
de: Es ist unklar, wie lange das andauern wird. Aber vielleicht sind andere Seiten noch erreichbar.

source: Smerge is a version control system for the block-based language <em>Snap!</em>,
de: Smerge ist ein Versionskontrollsystem für die blockbasierte Sprache <em>Snap!</em>.

source: which enables collaboration and tinkering in the classroom.
de: Es erlaubt die einfache Kollaboration im Klassenzimmer.

source: It&#39;s tailored to novice programmers and therefore easy to use for teachers and students.
de: Smerge richtet sich an Novizen in der Programmierung und ist für Lehrerinnen und Lehrer sowie Schülerinnen und Schüler einfach nutzbar.

source: What we wanted to avoid was making a feature-overloaded git clone.
de: Wir wollten keinen überladenen Git-Klon erschaffen.

source: Our Badger&#39;s sett
de: Unser Dachsbau

source: A Badger works on his sett, containing a lot of tunnels and chambers, with all his family members and is gradually expanding it over years.
de: Ein Dachs arbeitet jahrelang zusammen mit seiner ganzen Familie an seinem Bau mit all den Kammern und Tunnels.

source: We proceed in exactly the same way while programming: our progress and the further development of the program from version to version we can also present as a &quot;badger&#39;s sett&quot;.
de: Bei Programmieren gehen wir eigentlich genauso vor. Wir könnnen unseren Entwicklungsfortschritt von Version zu Version als Dachsbau darstellen.

source: In this example, we are developing asteroids, the game in which you have to destroy all asteroids with your starship before they hit the ship.
de: In diesem Beispiel entwickeln wir das Spiel Asteroids, in dem es darum geht Asteroiden zu zerstören bevor diese das Schiff treffen.

source: But how do we come to such a &quot;badger&#39;s burrow&quot;?
de: Wie aber kommen wir zu so einem Dachsbau?

source: We can open any of the versions directly in <em>Snap!</em> with a double click.
de: Wir können Versionen über einen Doppelklick direkt in Snap! öffnen.

source: Then we can work on our project, as we are used to.
de: Dann können wir wie gewohnt an unseren Projekten arbeiten.

source: To save the changes in <em>Snap!</em>, we have to &quot;post&quot; them to our badgers sett.
de: Um unsere Änderungen zu speichern, müssen wir Sie in unserem Dachsbau &quot;posten&quot;.

source: This is done via the corresponding block post to &quot;smerge...&quot; under Variables.
de: Das erfolgt über den Block post to &quot;smerge...&quot; in der Kategorie Variablen.

source: We can summarize what we have done; this way, we will find this particular version of your project later again.
de: Wir können außerdem zusammenfassen, was wir gemacht haben. So finden wir diese Version später leichter wieder.

source: Then we can find them in our badgers sett on smerge.org.
de: Außerdem finden wir sie dann auch in unserem Dachsbau auf smerge.org.

source: Working alone is boring...
de: Alleine zu arbeiten ist langweilig...

source: A badger does not work alone on his construction, but with the whole family. Everyone digs their own tunnel.
de: Ein Dachs arbeitet nicht alleine an seiner Konstruktion. Seine Familie unterstützt ihn. Jeder gräbt seinen eigenen Tunnel.

source: It&#39;s the same with us when we work collaboratively. We split the work: You work on making the spaceship able to shoot, while a friend or team member handles the asteroids flying through space.
de: Bei uns ist es genauso, wenn wir gemeinsam arbeiten. Wir teilen die Arbeit auf: Du arbeitest daran, das Raumschiff schussfähig zu machen, während ein Freund oder Teammitglied die Asteroiden durch den Weltraum fliegt.

source: As you see, everyone is working in his own &quot;tunnels&quot;!
de: Wie du siehst, arbeitet jeder in seinem eigenen &quot;Tunnel&quot;!

source: At a certain point the badger wants to meet up with his family members. In the same way, we want to merge our changes to the project. Eventually we want to play the game, don&#39;t we?
de: An einem bestimmten Punkt will sich der Dachs mit seinen Familienmitgliedern treffen. Ebenso wollen wir unsere Änderungen im Projekt zusammenführen. Irgendwann wollen wir das Spiel ja auch spielen, nicht wahr?

source: Therefore we simply click the &quot;merge&quot;-Button in the bottom right, tick all the versions we would like to merge, and click yes to confirm.
de: Dazu klicken wir einfach auf den „Merge“-Button unten rechts, kreuzen alle Versionen an, die wir zusammenführen möchten, und bestätigen mit Ja.

source: Now we will find a new version, with all changes merged. But what happens if more than one made changes to the same script? If such a situation occurs, we will have to manually choose with version we want to keep:
de: Jetzt haben wir eine neue Version mit den zusammengeführten Änderungen. Was aber passiert, wenn wir mehr als eine Änderung am selben Skript gemacht haben? In einer solchen Situiation müssen wir manuell wählen, welche Version wir behalten wollen:

source: Go back if you made a mistake
de: Gehe zurück, wenn du einen Fehler gemacht hast

source: Sometimes the badger abandons one tunnel, e.g. due to a lack of stability. He then has to go back and up in his sett, and work on from a different chamber. In the same way, sometimes we have to go back to an older version, e.g. because we made some mistakes or tried something that didn&#39;t really work out. In order to do so, we simply open the version we want to rever to, open it in <em>Snap!</em> by double-clicking, and work on from there. This way, we will get a new &quot;tunnel&quot;.
de: Manchmal verlässt der Dachs einen Tunnel, z.B. wegen mangelnder Stabilität. Dann muss er in seinem Bau hin und her gehen und von einer anderen Kammer aus weiterarbeiten. Auf die gleiche Weise müssen wir manchmal auf eine ältere Version zurückgreifen, z.B. weil wir einige Fehler gemacht oder etwas ausprobiert haben, was nicht wirklich funktioniert hat. Dazu öffnen wir einfach die Version, auf die wir zurückgehen möchten, öffnen sie in Snap! durch Doppelklick und arbeiten von dort aus weiter. Auf diese Weise erhalten wir einen neuen &quot;Tunnel&quot;.

source: Built for teachers and the classroom
de: Entwickelt für Lehrpersonen und das Klassenzimmer

source: What does Smerge offer you and how it can help with teaching?
de: Wie kann Smerge beim Unterrichten helfen?

source: enabling collaboration for project-based learning with <em>Snap!</em>
de: Smerge ermöglicht die Zusammenarbeit in projektbasiertem Lernen mit <em>Snap!</em>

source: all the data is always available and automatically backed up, so no more &quot;I forgot my stuff at home&quot; or &quot;my partner is ill, I can&#39;t work&quot; from your students.
de: Alle Daten sind stets verfügbar und werden automatisch gesichert. Also Schluss mit dem &quot;Ich habe meine Sachen zuhause vergessen&quot; oder &quot;Mein Partner ist krank, ich kann nicht weiterarbeiten.

source: set up templates in the sense of &quot;code skeletons&quot;, where you can supply your students with custom blocks, some code pieces already in place, ... You can even add further templates via drag and drop.
de: Lege Templates oder Sleketons an, um den Schülerinnen und Schülern eigene Blöcke oder vorgefertigen Code bereitzustellen. Weitere Templates können übrigens immer über Drag-and-Drop hinzugefügt werden.

source: the development process is always visible, to your students as well as to you. This allows for assessing individual contribution and giving individual feedback.
de: der Entwicklungsprozess ist stets sichbar für dich aber auch für deine Schülerinnen und Schüler. Das erlaubt es individuelles Feedback zu geben.

source: you see the version history and are able to revert changes and go back to old versions, which enables tinkering and playing around in a risk-free enviroment.
de: du siehst die Versionhistorie, kannst Änderungen rückgängig machen und so ganz risikofrei experimentieren.

source: Login and User Management
de: Login und User Management

source: We deliberatly have no dedicated user accounts or management. Instead, to secure your projects, you will get a PIN on the time of project creation, and can set a password. If you add your e-mail at project creation, you can retrieve your PIN and password for all your projects if you forgot them.
de: Wir haben bewusst keine eigenen Benutzerkonten oder ein eigenes Usermanagement. Um Ihre Projekte zu sichern, erhalten Sie stattdessen bei der Projekterstellung eine PIN und können ein Passwort festlegen. Wenn Sie Ihre E-Mail bei der Projekterstellung hinterlegen, können Sie bei Bedarf PIN und Passwort für all Ihre Projekte abrufen, falls Sie diese vergessen haben.

source: Want to know more or need help?
de: Möchtest du mehr erfahren oder benötigst du Hilfe?

source: About Smerge
de: Über Smerge

source: This are your PIN and password, which you need to open your Smerge-project.
de: Das sind deine PIN und dein Passwort, die du zum Öffnen deines Smerge-Projekts benötigst.

source: It might be a good idea to keep them somewhere, so you wont forget them!
de: Schreib sie dir am Besten auf, damit du sie nicht vergisst!

source: This is your PIN, which you need to open your smerge-project.
de: Dies ist deine PIN, die du zum Öffnen deines Projekts benötigst.

source: It might be a good idea to keep it somewhere, so you wont forget it!
de: Schreib sie dir am Besten auf, damit du sie nicht vergisst!

source: If you want to have a password as well, you can change this later on.
de: Falls Du doch ein Passwort hinzugefügen willst, kannst du das später hinzufügen.

source: Password:
de: Passwort:

source: Hello,
de: Hallo,

source: you forgot one of your passwords or PINs of the smerge-projects you are registered with this mail-address. In the following you find all your projects and the corresponding information you need to login.
de: Du hast das Passwort oder die Punk deiner Smerge-Projekte vergessen?Im Folgenden findest du all deine Projekte und die dazugehörigen Login Informationen.

source: So what are you waiting for? Smerge on on smerge.org!
de: Worauf wartest du? Leg los auf smerge.org!

source: Project:
de: Projekt:

source: Description:
de: Beschreibung:

source: Password:
de: Passwort:

source: Open an existing project
de: Öffne ein existierendes Projekt

source: I forgot my Password or PIN
de: Ich habe Passwort oder PIN vergessen

source: Submit
de: Los

source: Drop here!
de: Hier ablegen!

source: cancel merge
de: Merge abbrechen

source: merge
de: mergen

source: Project Settings
de: Projekteinstellungen

source: Title
de: Titel

source: Change Project Description
de: Ändere Projektbeschreibung

source: Delete Project
de: Lösche Projekt

source: Insert your password to delete this project.
de: Gib dein Passwort ein, um dieses Projekt zu löschen.

source: Close
de: Schließen

source: Enter your email to restore all you're projects passwords or PINs
de: Gib deine Emailadresse ein, um deine Projektpasswörter und PINs wiederzuerlangen.
